#### FileSaveDialog Members

---

|  |
| --- |
| FileSaveDialog Class   Constructors   Methods   Properties   See Also |

The  FileSaveDialog  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | FileSaveDialog | Constructs a new instance of a File Save dialog. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  FileDialog  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetSelectedModelPath | Returns the selected file path chosen by the user. (Inherited from  FileDialog  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | Show | Shows the dialog using the stored settings. (Inherited from  FileDialog  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | DefaultFilterEntry | The default entry (from the filter) to be selected in the dialog. (Inherited from  FileDialog  .) |
| Public property | Filter | The filter string representing a collection of extensions allowed by the dialog. (Inherited from  FileDialog  .) |
| Public property | InitialFileName | The initial file name to be shown for this save operation. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  FileDialog  .) |
| Public property | Title | The title to show on the dialog. (Inherited from  FileDialog  .) |

# See Also

FileSaveDialog Class

Autodesk.Revit.UI Namespace